In [ ]:
# üîÅ Removing Duplicates in Pandas

# Duplicate rows can lead to incorrect results in data analysis.  
# Pandas provides easy tools to detect and remove them using:

# - `df.duplicated()` ‚Üí Finds duplicate rows  
# - `df.drop_duplicates()` ‚Üí Removes duplicate rows

In [2]:
import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Alice", "Charlie", "Bob"],
    "Age": [25, 30, 25, 35, 30],
    "City": ["New York", "London", "New York", "Paris", "London"]
}

df = pd.DataFrame(data)
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2    Alice   25  New York
3  Charlie   35     Paris
4      Bob   30    London

In [9]:
df.duplicated()

## üîç Detecting Duplicates

# Use `.duplicated()` to check which rows are duplicates.

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [8]:
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2    Alice   25  New York
3  Charlie   35     Paris
4      Bob   30    London

In [10]:
df_cleaned = df.drop_duplicates()
df_cleaned

## üßπ Remove Duplicates

# Use `drop_duplicates()` to keep only the first occurrence of each duplicate row.

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
3  Charlie   35     Paris